; domain
(define (domain drone-domain)


(:requirements :strips :typing )


(:types
    person crate food medicine location drone - object
)


(:predicates
    (at ?o - object ?l - location)
    (crate-content ?b - crate ?content - object)
    (person-needs ?p - person ?content - object)
    (person-has ?p - person ?content - object)
    (arm1-free ?d - drone)
    (arm1-load ?d - drone ?b - crate)
    (arm2-free ?d - drone)
    (arm2-load ?d - drone ?b - crate)
)


(:action move-drone
    :parameters (
        ?drone - drone ?origin - location ?destination - location 
    )
    :precondition (and 
        (at ?drone ?origin)
    )
    :effect (and 
        (not (at ?drone ?origin))
        (at ?drone ?destination)
    )
)

(:action grab-arm1
    :parameters (
        ?d - drone ?b - crate ?l - location
    )
    :precondition (and 
        (at ?d ?l)
        (at ?b ?l)
        (arm1-free ?d)
    )
    :effect (and 
        (not (arm1-free ?d))
        (arm1-load ?d ?b)
        (not (at ?b ?l))
    )
)

(:action grab-arm2
    :parameters (
        ?d - drone ?b - crate ?l - location
    )
    :precondition (and 
        (at ?d ?l)
        (at ?b ?l)
        (arm2-free ?d)
    )
    :effect (and 
        (not (arm2-free ?d))
        (arm2-load ?d ?b)
        (not (at ?b ?l))
    )
)

(:action deliver-arm1
    :parameters (
        ?d - drone ?p - person ?b - crate ?content - object ?l - location
    )
    :precondition (and 
        (arm1-load ?d ?b)
        (at ?d ?l)
        (at ?p ?l)
        (crate-content ?b ?content)
        (person-needs ?p ?content)
    )
    :effect (and 
        (not (arm1-load ?d ?b))
        (arm1-free ?d)
        (not (person-needs ?p ?content))
        (person-has ?p ?content)
    )
)

(:action deliver-arm2
    :parameters (
        ?d - drone ?p - person ?b - crate ?content - object ?l - location
    )
    :precondition (and 
        (arm2-load ?d ?b)
        (at ?d ?l)
        (at ?p ?l)
        (crate-content ?b ?content)
        (person-needs ?p ?content)
    )
    :effect (and 
        (not (arm2-load ?d ?b))
        (arm2-free ?d)
        (not (person-needs ?p ?content))
        (person-has ?p ?content)
    )
)


)

; problem
(define (problem drone_problem_d1_r0_l28_p28_c28_g28_ct2)
(:domain drone-domain)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	loc11 - location
	loc12 - location
	loc13 - location
	loc14 - location
	loc15 - location
	loc16 - location
	loc17 - location
	loc18 - location
	loc19 - location
	loc20 - location
	loc21 - location
	loc22 - location
	loc23 - location
	loc24 - location
	loc25 - location
	loc26 - location
	loc27 - location
	loc28 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	crate10 - crate
	crate11 - crate
	crate12 - crate
	crate13 - crate
	crate14 - crate
	crate15 - crate
	crate16 - crate
	crate17 - crate
	crate18 - crate
	crate19 - crate
	crate20 - crate
	crate21 - crate
	crate22 - crate
	crate23 - crate
	crate24 - crate
	crate25 - crate
	crate26 - crate
	crate27 - crate
	crate28 - crate
	food - contents
	medicine - contents
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	person20 - person
	person21 - person
	person22 - person
	person23 - person
	person24 - person
	person25 - person
	person26 - person
	person27 - person
	person28 - person
)
(:init
	(at drone1 depot)
	(arm1-free drone1)
	(arm2-free drone1)
	(at crate1 depot)
	(at crate2 depot)
	(at crate3 depot)
	(at crate4 depot)
	(at crate5 depot)
	(at crate6 depot)
	(at crate7 depot)
	(at crate8 depot)
	(at crate9 depot)
	(at crate10 depot)
	(at crate11 depot)
	(at crate12 depot)
	(at crate13 depot)
	(at crate14 depot)
	(at crate15 depot)
	(at crate16 depot)
	(at crate17 depot)
	(at crate18 depot)
	(at crate19 depot)
	(at crate20 depot)
	(at crate21 depot)
	(at crate22 depot)
	(at crate23 depot)
	(at crate24 depot)
	(at crate25 depot)
	(at crate26 depot)
	(at crate27 depot)
	(at crate28 depot)
	(crate-content crate1 food)
	(crate-content crate2 food)
	(crate-content crate3 food)
	(crate-content crate4 food)
	(crate-content crate5 food)
	(crate-content crate6 food)
	(crate-content crate7 food)
	(crate-content crate8 food)
	(crate-content crate9 food)
	(crate-content crate10 food)
	(crate-content crate11 food)
	(crate-content crate12 food)
	(crate-content crate13 food)
	(crate-content crate14 food)
	(crate-content crate15 food)
	(crate-content crate16 food)
	(crate-content crate17 food)
	(crate-content crate18 food)
	(crate-content crate19 food)
	(crate-content crate20 food)
	(crate-content crate21 food)
	(crate-content crate22 food)
	(crate-content crate23 food)
	(crate-content crate24 food)
	(crate-content crate25 food)
	(crate-content crate26 food)
	(crate-content crate27 medicine)
	(crate-content crate28 medicine)
	(at person1 loc16)
	(at person2 loc1)
	(at person3 loc15)
	(at person4 loc24)
	(at person5 loc1)
	(at person6 loc25)
	(at person7 loc25)
	(at person8 loc16)
	(at person9 loc25)
	(at person10 loc12)
	(at person11 loc21)
	(at person12 loc5)
	(at person13 loc20)
	(at person14 loc5)
	(at person15 loc2)
	(at person16 loc7)
	(at person17 loc4)
	(at person18 loc9)
	(at person19 loc3)
	(at person20 loc8)
	(at person21 loc10)
	(at person22 loc11)
	(at person23 loc14)
	(at person24 loc21)
	(at person25 loc1)
	(at person26 loc10)
	(at person27 loc24)
	(at person28 loc7)
	(person-needs person1 food)
	(person-needs person3 food)
	(person-needs person4 food)
	(person-needs person6 food)
	(person-needs person7 food)
	(person-needs person8 food)
	(person-needs person9 food)
	(person-needs person10 food)
	(person-needs person11 food)
	(person-needs person12 food)
	(person-needs person13 food)
	(person-needs person14 food)
	(person-needs person15 food)
	(person-needs person16 food)
	(person-needs person17 food)
	(person-needs person18 food)
	(person-needs person19 food)
	(person-needs person20 food)
	(person-needs person21 food)
	(person-needs person22 food)
	(person-needs person22 medicine)
	(person-needs person23 food)
	(person-needs person24 food)
	(person-needs person25 food)
	(person-needs person26 food)
	(person-needs person27 food)
	(person-needs person27 medicine)
	(person-needs person28 food)
)
(:goal (and
	(at drone1 depot)
	(person-has person1 food)
	(person-has person3 food)
	(person-has person4 food)
	(person-has person6 food)
	(person-has person7 food)
	(person-has person8 food)
	(person-has person9 food)
	(person-has person10 food)
	(person-has person11 food)
	(person-has person12 food)
	(person-has person13 food)
	(person-has person14 food)
	(person-has person15 food)
	(person-has person16 food)
	(person-has person17 food)
	(person-has person18 food)
	(person-has person19 food)
	(person-has person20 food)
	(person-has person21 food)
	(person-has person22 food)
	(person-has person22 medicine)
	(person-has person23 food)
	(person-has person24 food)
	(person-has person25 food)
	(person-has person26 food)
	(person-has person27 food)
	(person-has person27 medicine)
	(person-has person28 food)
	))
)

; plan
1. (grab-arm1 drone1 crate27 depot)
   deleted: (arm1-free drone1) (at crate27 depot)
   added: (arm1-load drone1 crate27)
   goals met: 1 of 29
2. (grab-arm2 drone1 crate28 depot)
   deleted: (arm2-free drone1) (at crate28 depot)
   added: (arm2-load drone1 crate28)
   goals met: 1 of 29
3. (move-drone drone1 depot loc24)
   deleted: (at drone1 depot)
   added: (at drone1 loc24)
   goals met: 0 of 29
4. (deliver-arm2 drone1 person27 crate28 medicine loc24)
   deleted: (arm2-load drone1 crate28) (person-needs person27 medicine)
   added: (arm2-free drone1) (person-has person27 medicine)
   goals met: 1 of 29
5. (move-drone drone1 loc24 depot)
   deleted: (at drone1 loc24)
   added: (at drone1 depot)
   goals met: 2 of 29
6. (move-drone drone1 depot loc11)
   deleted: (at drone1 depot)
   added: (at drone1 loc11)
   goals met: 1 of 29
7. (deliver-arm1 drone1 person22 crate27 medicine loc11)
   deleted: (arm1-load drone1 crate27) (person-needs person22 medicine)
   added: (arm1-free drone1) (person-has person22 medicine)
   goals met: 2 of 29
8. (move-drone drone1 loc11 depot)
   deleted: (at drone1 loc11)
   added: (at drone1 depot)
   goals met: 3 of 29
9. (grab-arm1 drone1 crate9 depot)
   deleted: (arm1-free drone1) (at crate9 depot)
   added: (arm1-load drone1 crate9)
   goals met: 3 of 29
10. (grab-arm2 drone1 crate15 depot)
   deleted: (arm2-free drone1) (at crate15 depot)
   added: (arm2-load drone1 crate15)
   goals met: 3 of 29
11. (move-drone drone1 depot loc24)
   deleted: (at drone1 depot)
   added: (at drone1 loc24)
   goals met: 2 of 29
12. (deliver-arm1 drone1 person4 crate9 food loc24)
   deleted: (arm1-load drone1 crate9) (person-needs person4 food)
   added: (arm1-free drone1) (person-has person4 food)
   goals met: 3 of 29
13. (move-drone drone1 loc24 loc25)
   deleted: (at drone1 loc24)
   added: (at drone1 loc25)
   goals met: 3 of 29
14. (deliver-arm2 drone1 person6 crate15 food loc25)
   deleted: (arm2-load drone1 crate15) (person-needs person6 food)
   added: (arm2-free drone1) (person-has person6 food)
   goals met: 4 of 29
15. (move-drone drone1 loc25 depot)
   deleted: (at drone1 loc25)
   added: (at drone1 depot)
   goals met: 5 of 29
16. (grab-arm2 drone1 crate18 depot)
   deleted: (arm2-free drone1) (at crate18 depot)
   added: (arm2-load drone1 crate18)
   goals met: 5 of 29
17. (grab-arm1 drone1 crate19 depot)
   deleted: (arm1-free drone1) (at crate19 depot)
   added: (arm1-load drone1 crate19)
   goals met: 5 of 29
18. (move-drone drone1 depot loc25)
   deleted: (at drone1 depot)
   added: (at drone1 loc25)
   goals met: 4 of 29
19. (deliver-arm2 drone1 person7 crate18 food loc25)
   deleted: (arm2-load drone1 crate18) (person-needs person7 food)
   added: (arm2-free drone1) (person-has person7 food)
   goals met: 5 of 29
20. (move-drone drone1 loc25 loc16)
   deleted: (at drone1 loc25)
   added: (at drone1 loc16)
   goals met: 5 of 29
21. (deliver-arm1 drone1 person8 crate19 food loc16)
   deleted: (arm1-load drone1 crate19) (person-needs person8 food)
   added: (arm1-free drone1) (person-has person8 food)
   goals met: 6 of 29
22. (move-drone drone1 loc16 depot)
   deleted: (at drone1 loc16)
   added: (at drone1 depot)
   goals met: 7 of 29
23. (grab-arm2 drone1 crate13 depot)
   deleted: (arm2-free drone1) (at crate13 depot)
   added: (arm2-load drone1 crate13)
   goals met: 7 of 29
24. (move-drone drone1 depot loc25)
   deleted: (at drone1 depot)
   added: (at drone1 loc25)
   goals met: 6 of 29
25. (deliver-arm2 drone1 person9 crate13 food loc25)
   deleted: (arm2-load drone1 crate13) (person-needs person9 food)
   added: (arm2-free drone1) (person-has person9 food)
   goals met: 7 of 29
26. (move-drone drone1 loc25 depot)
   deleted: (at drone1 loc25)
   added: (at drone1 depot)
   goals met: 8 of 29
27. (grab-arm2 drone1 crate26 depot)
   deleted: (arm2-free drone1) (at crate26 depot)
   added: (arm2-load drone1 crate26)
   goals met: 8 of 29
28. (move-drone drone1 depot loc12)
   deleted: (at drone1 depot)
   added: (at drone1 loc12)
   goals met: 7 of 29
29. (deliver-arm2 drone1 person10 crate26 food loc12)
   deleted: (arm2-load drone1 crate26) (person-needs person10 food)
   added: (arm2-free drone1) (person-has person10 food)
   goals met: 8 of 29
30. (move-drone drone1 loc12 depot)
   deleted: (at drone1 loc12)
   added: (at drone1 depot)
   goals met: 9 of 29
31. (grab-arm2 drone1 crate10 depot)
   deleted: (arm2-free drone1) (at crate10 depot)
   added: (arm2-load drone1 crate10)
   goals met: 9 of 29
32. (grab-arm1 drone1 crate16 depot)
   deleted: (arm1-free drone1) (at crate16 depot)
   added: (arm1-load drone1 crate16)
   goals met: 9 of 29
33. (move-drone drone1 depot loc21)
   deleted: (at drone1 depot)
   added: (at drone1 loc21)
   goals met: 8 of 29
34. (deliver-arm2 drone1 person11 crate10 food loc21)
   deleted: (arm2-load drone1 crate10) (person-needs person11 food)
   added: (arm2-free drone1) (person-has person11 food)
   goals met: 9 of 29
35. (move-drone drone1 loc21 loc5)
   deleted: (at drone1 loc21)
   added: (at drone1 loc5)
   goals met: 9 of 29
36. (deliver-arm1 drone1 person12 crate16 food loc5)
   deleted: (arm1-load drone1 crate16) (person-needs person12 food)
   added: (arm1-free drone1) (person-has person12 food)
   goals met: 10 of 29
37. (move-drone drone1 loc5 depot)
   deleted: (at drone1 loc5)
   added: (at drone1 depot)
   goals met: 11 of 29
38. (grab-arm2 drone1 crate17 depot)
   deleted: (arm2-free drone1) (at crate17 depot)
   added: (arm2-load drone1 crate17)
   goals met: 11 of 29
39. (grab-arm1 drone1 crate1 depot)
   deleted: (arm1-free drone1) (at crate1 depot)
   added: (arm1-load drone1 crate1)
   goals met: 11 of 29
40. (move-drone drone1 depot loc20)
   deleted: (at drone1 depot)
   added: (at drone1 loc20)
   goals met: 10 of 29
41. (deliver-arm2 drone1 person13 crate17 food loc20)
   deleted: (arm2-load drone1 crate17) (person-needs person13 food)
   added: (arm2-free drone1) (person-has person13 food)
   goals met: 11 of 29
42. (move-drone drone1 loc20 loc5)
   deleted: (at drone1 loc20)
   added: (at drone1 loc5)
   goals met: 11 of 29
43. (deliver-arm1 drone1 person14 crate1 food loc5)
   deleted: (arm1-load drone1 crate1) (person-needs person14 food)
   added: (arm1-free drone1) (person-has person14 food)
   goals met: 12 of 29
44. (move-drone drone1 loc5 depot)
   deleted: (at drone1 loc5)
   added: (at drone1 depot)
   goals met: 13 of 29
45. (grab-arm2 drone1 crate4 depot)
   deleted: (arm2-free drone1) (at crate4 depot)
   added: (arm2-load drone1 crate4)
   goals met: 13 of 29
46. (grab-arm1 drone1 crate25 depot)
   deleted: (arm1-free drone1) (at crate25 depot)
   added: (arm1-load drone1 crate25)
   goals met: 13 of 29
47. (move-drone drone1 depot loc2)
   deleted: (at drone1 depot)
   added: (at drone1 loc2)
   goals met: 12 of 29
48. (deliver-arm2 drone1 person15 crate4 food loc2)
   deleted: (arm2-load drone1 crate4) (person-needs person15 food)
   added: (arm2-free drone1) (person-has person15 food)
   goals met: 13 of 29
49. (move-drone drone1 loc2 loc7)
   deleted: (at drone1 loc2)
   added: (at drone1 loc7)
   goals met: 13 of 29
50. (deliver-arm1 drone1 person16 crate25 food loc7)
   deleted: (arm1-load drone1 crate25) (person-needs person16 food)
   added: (arm1-free drone1) (person-has person16 food)
   goals met: 14 of 29
51. (move-drone drone1 loc7 depot)
   deleted: (at drone1 loc7)
   added: (at drone1 depot)
   goals met: 15 of 29
52. (grab-arm1 drone1 crate12 depot)
   deleted: (arm1-free drone1) (at crate12 depot)
   added: (arm1-load drone1 crate12)
   goals met: 15 of 29
53. (grab-arm2 drone1 crate21 depot)
   deleted: (arm2-free drone1) (at crate21 depot)
   added: (arm2-load drone1 crate21)
   goals met: 15 of 29
54. (move-drone drone1 depot loc4)
   deleted: (at drone1 depot)
   added: (at drone1 loc4)
   goals met: 14 of 29
55. (deliver-arm1 drone1 person17 crate12 food loc4)
   deleted: (arm1-load drone1 crate12) (person-needs person17 food)
   added: (arm1-free drone1) (person-has person17 food)
   goals met: 15 of 29
56. (move-drone drone1 loc4 loc9)
   deleted: (at drone1 loc4)
   added: (at drone1 loc9)
   goals met: 15 of 29
57. (deliver-arm2 drone1 person18 crate21 food loc9)
   deleted: (arm2-load drone1 crate21) (person-needs person18 food)
   added: (arm2-free drone1) (person-has person18 food)
   goals met: 16 of 29
58. (move-drone drone1 loc9 depot)
   deleted: (at drone1 loc9)
   added: (at drone1 depot)
   goals met: 17 of 29
59. (grab-arm1 drone1 crate11 depot)
   deleted: (arm1-free drone1) (at crate11 depot)
   added: (arm1-load drone1 crate11)
   goals met: 17 of 29
60. (grab-arm2 drone1 crate8 depot)
   deleted: (arm2-free drone1) (at crate8 depot)
   added: (arm2-load drone1 crate8)
   goals met: 17 of 29
61. (move-drone drone1 depot loc3)
   deleted: (at drone1 depot)
   added: (at drone1 loc3)
   goals met: 16 of 29
62. (deliver-arm1 drone1 person19 crate11 food loc3)
   deleted: (arm1-load drone1 crate11) (person-needs person19 food)
   added: (arm1-free drone1) (person-has person19 food)
   goals met: 17 of 29
63. (move-drone drone1 loc3 loc8)
   deleted: (at drone1 loc3)
   added: (at drone1 loc8)
   goals met: 17 of 29
64. (deliver-arm2 drone1 person20 crate8 food loc8)
   deleted: (arm2-load drone1 crate8) (person-needs person20 food)
   added: (arm2-free drone1) (person-has person20 food)
   goals met: 18 of 29
65. (move-drone drone1 loc8 depot)
   deleted: (at drone1 loc8)
   added: (at drone1 depot)
   goals met: 19 of 29
66. (grab-arm2 drone1 crate2 depot)
   deleted: (arm2-free drone1) (at crate2 depot)
   added: (arm2-load drone1 crate2)
   goals met: 19 of 29
67. (move-drone drone1 depot loc10)
   deleted: (at drone1 depot)
   added: (at drone1 loc10)
   goals met: 18 of 29
68. (deliver-arm2 drone1 person21 crate2 food loc10)
   deleted: (arm2-load drone1 crate2) (person-needs person21 food)
   added: (arm2-free drone1) (person-has person21 food)
   goals met: 19 of 29
69. (move-drone drone1 loc10 depot)
   deleted: (at drone1 loc10)
   added: (at drone1 depot)
   goals met: 20 of 29
70. (grab-arm2 drone1 crate3 depot)
   deleted: (arm2-free drone1) (at crate3 depot)
   added: (arm2-load drone1 crate3)
   goals met: 20 of 29
71. (grab-arm1 drone1 crate7 depot)
   deleted: (arm1-free drone1) (at crate7 depot)
   added: (arm1-load drone1 crate7)
   goals met: 20 of 29
72. (move-drone drone1 depot loc11)
   deleted: (at drone1 depot)
   added: (at drone1 loc11)
   goals met: 19 of 29
73. (deliver-arm2 drone1 person22 crate3 food loc11)
   deleted: (arm2-load drone1 crate3) (person-needs person22 food)
   added: (arm2-free drone1) (person-has person22 food)
   goals met: 20 of 29
74. (move-drone drone1 loc11 loc16)
   deleted: (at drone1 loc11)
   added: (at drone1 loc16)
   goals met: 20 of 29
75. (deliver-arm1 drone1 person1 crate7 food loc16)
   deleted: (arm1-load drone1 crate7) (person-needs person1 food)
   added: (arm1-free drone1) (person-has person1 food)
   goals met: 21 of 29
76. (move-drone drone1 loc16 depot)
   deleted: (at drone1 loc16)
   added: (at drone1 depot)
   goals met: 22 of 29
77. (grab-arm2 drone1 crate22 depot)
   deleted: (arm2-free drone1) (at crate22 depot)
   added: (arm2-load drone1 crate22)
   goals met: 22 of 29
78. (grab-arm1 drone1 crate20 depot)
   deleted: (arm1-free drone1) (at crate20 depot)
   added: (arm1-load drone1 crate20)
   goals met: 22 of 29
79. (move-drone drone1 depot loc14)
   deleted: (at drone1 depot)
   added: (at drone1 loc14)
   goals met: 21 of 29
80. (deliver-arm2 drone1 person23 crate22 food loc14)
   deleted: (arm2-load drone1 crate22) (person-needs person23 food)
   added: (arm2-free drone1) (person-has person23 food)
   goals met: 22 of 29
81. (move-drone drone1 loc14 loc21)
   deleted: (at drone1 loc14)
   added: (at drone1 loc21)
   goals met: 22 of 29
82. (deliver-arm1 drone1 person24 crate20 food loc21)
   deleted: (arm1-load drone1 crate20) (person-needs person24 food)
   added: (arm1-free drone1) (person-has person24 food)
   goals met: 23 of 29
83. (move-drone drone1 loc21 depot)
   deleted: (at drone1 loc21)
   added: (at drone1 depot)
   goals met: 24 of 29
84. (grab-arm2 drone1 crate23 depot)
   deleted: (arm2-free drone1) (at crate23 depot)
   added: (arm2-load drone1 crate23)
   goals met: 24 of 29
85. (move-drone drone1 depot loc16)
   deleted: (at drone1 depot)
   added: (at drone1 loc16)
   goals met: 23 of 29
86. (move-drone drone1 loc16 loc1)
   deleted: (at drone1 loc16)
   added: (at drone1 loc1)
   goals met: 23 of 29
87. (deliver-arm2 drone1 person25 crate23 food loc1)
   deleted: (arm2-load drone1 crate23) (person-needs person25 food)
   added: (arm2-free drone1) (person-has person25 food)
   goals met: 24 of 29
88. (move-drone drone1 loc1 depot)
   deleted: (at drone1 loc1)
   added: (at drone1 depot)
   goals met: 25 of 29
89. (grab-arm2 drone1 crate6 depot)
   deleted: (arm2-free drone1) (at crate6 depot)
   added: (arm2-load drone1 crate6)
   goals met: 25 of 29
90. (grab-arm1 drone1 crate24 depot)
   deleted: (arm1-free drone1) (at crate24 depot)
   added: (arm1-load drone1 crate24)
   goals met: 25 of 29
91. (move-drone drone1 depot loc10)
   deleted: (at drone1 depot)
   added: (at drone1 loc10)
   goals met: 24 of 29
92. (deliver-arm2 drone1 person26 crate6 food loc10)
   deleted: (arm2-load drone1 crate6) (person-needs person26 food)
   added: (arm2-free drone1) (person-has person26 food)
   goals met: 25 of 29
93. (move-drone drone1 loc10 loc24)
   deleted: (at drone1 loc10)
   added: (at drone1 loc24)
   goals met: 25 of 29
94. (deliver-arm1 drone1 person27 crate24 food loc24)
   deleted: (arm1-load drone1 crate24) (person-needs person27 food)
   added: (arm1-free drone1) (person-has person27 food)
   goals met: 26 of 29
95. (move-drone drone1 loc24 depot)
   deleted: (at drone1 loc24)
   added: (at drone1 depot)
   goals met: 27 of 29
96. (grab-arm1 drone1 crate5 depot)
   deleted: (arm1-free drone1) (at crate5 depot)
   added: (arm1-load drone1 crate5)
   goals met: 27 of 29
97. (move-drone drone1 depot loc15)
   deleted: (at drone1 depot)
   added: (at drone1 loc15)
   goals met: 26 of 29
98. (deliver-arm1 drone1 person3 crate5 food loc15)
   deleted: (arm1-load drone1 crate5) (person-needs person3 food)
   added: (arm1-free drone1) (person-has person3 food)
   goals met: 27 of 29
99. (move-drone drone1 loc15 depot)
   deleted: (at drone1 loc15)
   added: (at drone1 depot)
   goals met: 28 of 29
100. (grab-arm1 drone1 crate14 depot)
   deleted: (arm1-free drone1) (at crate14 depot)
   added: (arm1-load drone1 crate14)
   goals met: 28 of 29
101. (move-drone drone1 depot loc16)
   deleted: (at drone1 depot)
   added: (at drone1 loc16)
   goals met: 27 of 29
102. (move-drone drone1 loc16 loc7)
   deleted: (at drone1 loc16)
   added: (at drone1 loc7)
   goals met: 27 of 29
103. (deliver-arm1 drone1 person28 crate14 food loc7)
   deleted: (arm1-load drone1 crate14) (person-needs person28 food)
   added: (arm1-free drone1) (person-has person28 food)
   goals met: 28 of 29
104. (move-drone drone1 loc7 depot)
   deleted: (at drone1 loc7)
   added: (at drone1 depot)
   goals met: 29 of 29
